[
    {
        "title": "Prospect of Ukraine ceasefire still uncertain despite Trump's optimism",
        "publisher": "BBC News",
        "published_date": "2025-03-14T20:54:00.300Z",
        "article_content": "Ukraine's President Volodymyr Zelensky has accused Vladimir Putin of trying to \"sabotage\" diplomatic efforts to secure an immediate ceasefire. In a post on social media, he urged the US to put more pressure on the Russian president, saying only the \"strength of America\" could end the war. The Ukrainian leader said Putin was \"doing everything he can to sabotage diplomacy by setting extremely difficult and unacceptable conditions right from the start even before a ceasefire\". At his press conference on Thursday, Putin said he accepted the idea of a ceasefire but qualified that with numerous questions about detail. He raised the Kursk border region, where Russian forces are retaking territory occupied by Ukraine six months ago. He accused Ukrainian forces of \"heinous crimes against civilians\" – something Kyiv denies - and asked whether they should walk free or surrender. He asked about whether Ukraine would use a ceasefire to mobilise, retrain and resupply its troops, without suggesting his forces might do the same. And Putin raised numerous questions about how a ceasefire could be monitored and policed along the frontline in the east. \"Who will be able to determine who violated the potential ceasefire agreement over a distance of 2,000 km and where exactly?\" he asked. \"Who will be held responsible for violating the ceasefire?\" At a meeting with journalists on Friday, Zelensky addressed these issues directly, especially the questions about verification. He said Ukraine was more than able to verify a ceasefire in the air and the sea. But he said the surveillance and intelligence capabilities of American and European aircraft and satellites would be needed to monitor the front line. Ukraine believes Putin's conditions of detail can be addressed. Much harder to deal with are Putin's objections of principle. He said any deal should \"proceed from the assumption that this cessation should lead to long-term peace and eliminate the root causes of this crisis\". By that, he means his objections to the expansion of the Nato military alliance and the very existence of Ukraine as a sovereign independent state. There is very little chance of that being addressed in any immediate interim ceasefire. Not for nothing did G7 foreign ministers meeting in Canada emphasise Ukraine's territorial integrity \"and its right to exist and its freedom, sovereignty and independence\". This is why Zelensky said \"Russia is the only party that wants the war to continue and diplomacy to break down\". So what could happen now? Well the ball is in America's court. President Trump could choose to step up pressure on Russia as Ukraine is demanding. He could impose more sanctions on Russia - and countries buying its cheap oil and gas. He could also give more military and intelligence support to Ukraine. Or alternatively Trump could offer Russia more concessions to get a deal over the line, a possibility that worries some here in Kyiv. Much of the contact between the US and Russia has been held in secret compared to the very public diplomatic pressure imposed on Ukraine. That is why Zelensky is calling out Russia's delaying tactics and urging the West to put more pressure on Putin. He may also be enjoying seeing Russia in the spotlight, having been the butt of American diplomatic efforts for more than a month since Trump and Putin had their first telephone call. The bottom line is that Trump has driven a diplomatic bulldozer through many international issues since his inauguration, including the war in Ukraine. But now he has come up against the walls of the Kremlin and they may be harder to get through. Trump wants a fast end to the fighting. Putin wants a \"painstaking\" discussion about details and principles. Two incompatible imperatives held by two stubborn leaders used to getting their way. Who will blink first? The prospects of a ceasefire are by no means certain, for all the American expressions of \"cautious optimism\". Voislav Torden, of Russian far-right group Rusich, is found guilty of charges relating to an ambush which killed 22. Gubaidulina was one of a group of composers blacklisted in the Soviet Union in 1979. Many belong to former President Bashar al-Assad's sect, which was targeted in mass killings. Russia is ready for a halt in fighting, says Vladimir Putin, but he says there are \"nuances\". The Russian president agrees fighting must end, but calls for the removal of the \"root causes\" of the war he launched. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "US influencer who snatched baby wombat has left Australia",
        "publisher": "BBC News",
        "published_date": "2025-03-14T07:58:14.978Z",
        "article_content": "Sam Jones, a US influencer who briefly snatched a baby wombat from its distressed mother, and uploaded the footage to social media has left Australia. Australia's Home Affairs minister Tony Burke had earlier said his department was reviewing whether it could revoke Ms Jones's visa, but the BBC understands that she left the country of her own accord. \"There has never been a better time to be a baby wombat,\" Burke said in a short statement on Friday celebrating Jones's departure. Anger erupted across Australia after Jones posted a video of her taking a baby wombat from the side of a road while laughing and running away from the distraught mother wombat. The video also shows the baby wombat hissing in distress before Jones then returns it to the bush. Jones, who also goes by the name Samantha Strable, has nearly 100,000 followers and describes herself as an \"outdoor enthusiast and hunter\" on her Instagram profile. She has since made her account private and deleted her post. Her video was swiftly met with widespread condemnation, with Australian Prime Minister Anthony Albanese calling the incident an \"outrage\". Foreign Minister Penny Wong called the video \"dreadful\". On Friday, opposition leader Peter Dutton said he thought it was \"a cruel act\" and that he was \"glad\" the influencer has now left. An online petition demanding Jones be deported from Australia garnered more than 30,000 signatures. However, as Jones had not been charged nor been deemed a threat to the country – the government may not have had any grounds to cancel her visa. In since-deleted comments, Jones said \"the baby was carefully held for one minute in total and then released back to mom\". \"They wandered back off into the bush together completely unharmed,\" she wrote. \"I don't ever capture wildlife that will be harmed by my doing so.\" But wildlife experts have deemed Jones's act a \"blatant disregard\" for native wildlife. The Wombat Protection Society said it was shocked to see the \"mishandling of a wombat joey in an apparent snatch for 'social media likes'\". Suzanne Milthorpe, Head of Campaigns at World Animal Protection Australia, told BBC Newsday that posting such a video for \"cheap content\" was \"unacceptable\". \"To that baby it must have seemed like a giant predator was picking it up and taking it away,\" she said. Wombats, which are native to Australia, are a legally protected species across the country. Baby wombats share a strong bond with their mothers, and any separation can be distressing and harmful, conservationists say. A new TikTok account claiming to be Jones after her original account was allegedly banned, published a post on Thursday saying that \"the hate is currently too much for me to handle\" and that there had been \"hundreds\" of death threats. \"Imagine someone just goes up to your child and curses at them? Let's have some respect,\" the post said. Most, however, have remained critical of Jones's act. \"Maybe imagine if someone picked up your child and laughed while you screamed for them to give them back,\" read a comment under the post, a reference to Jones's snatching of the wombat from its mother. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Prospect of Ukraine ceasefire still uncertain despite Trump's optimism",
        "publisher": "BBC News",
        "published_date": "2025-03-14T20:54:00.300Z",
        "article_content": "Ukraine's President Volodymyr Zelensky has accused Vladimir Putin of trying to \"sabotage\" diplomatic efforts to secure an immediate ceasefire. In a post on social media, he urged the US to put more pressure on the Russian president, saying only the \"strength of America\" could end the war. The Ukrainian leader said Putin was \"doing everything he can to sabotage diplomacy by setting extremely difficult and unacceptable conditions right from the start even before a ceasefire\". At his press conference on Thursday, Putin said he accepted the idea of a ceasefire but qualified that with numerous questions about detail. He raised the Kursk border region, where Russian forces are retaking territory occupied by Ukraine six months ago. He accused Ukrainian forces of \"heinous crimes against civilians\" – something Kyiv denies - and asked whether they should walk free or surrender. He asked about whether Ukraine would use a ceasefire to mobilise, retrain and resupply its troops, without suggesting his forces might do the same. And Putin raised numerous questions about how a ceasefire could be monitored and policed along the frontline in the east. \"Who will be able to determine who violated the potential ceasefire agreement over a distance of 2,000 km and where exactly?\" he asked. \"Who will be held responsible for violating the ceasefire?\" At a meeting with journalists on Friday, Zelensky addressed these issues directly, especially the questions about verification. He said Ukraine was more than able to verify a ceasefire in the air and the sea. But he said the surveillance and intelligence capabilities of American and European aircraft and satellites would be needed to monitor the front line. Ukraine believes Putin's conditions of detail can be addressed. Much harder to deal with are Putin's objections of principle. He said any deal should \"proceed from the assumption that this cessation should lead to long-term peace and eliminate the root causes of this crisis\". By that, he means his objections to the expansion of the Nato military alliance and the very existence of Ukraine as a sovereign independent state. There is very little chance of that being addressed in any immediate interim ceasefire. Not for nothing did G7 foreign ministers meeting in Canada emphasise Ukraine's territorial integrity \"and its right to exist and its freedom, sovereignty and independence\". This is why Zelensky said \"Russia is the only party that wants the war to continue and diplomacy to break down\". So what could happen now? Well the ball is in America's court. President Trump could choose to step up pressure on Russia as Ukraine is demanding. He could impose more sanctions on Russia - and countries buying its cheap oil and gas. He could also give more military and intelligence support to Ukraine. Or alternatively Trump could offer Russia more concessions to get a deal over the line, a possibility that worries some here in Kyiv. Much of the contact between the US and Russia has been held in secret compared to the very public diplomatic pressure imposed on Ukraine. That is why Zelensky is calling out Russia's delaying tactics and urging the West to put more pressure on Putin. He may also be enjoying seeing Russia in the spotlight, having been the butt of American diplomatic efforts for more than a month since Trump and Putin had their first telephone call. The bottom line is that Trump has driven a diplomatic bulldozer through many international issues since his inauguration, including the war in Ukraine. But now he has come up against the walls of the Kremlin and they may be harder to get through. Trump wants a fast end to the fighting. Putin wants a \"painstaking\" discussion about details and principles. Two incompatible imperatives held by two stubborn leaders used to getting their way. Who will blink first? The prospects of a ceasefire are by no means certain, for all the American expressions of \"cautious optimism\". Voislav Torden, of Russian far-right group Rusich, is found guilty of charges relating to an ambush which killed 22. Gubaidulina was one of a group of composers blacklisted in the Soviet Union in 1979. Many belong to former President Bashar al-Assad's sect, which was targeted in mass killings. Russia is ready for a halt in fighting, says Vladimir Putin, but he says there are \"nuances\". The Russian president agrees fighting must end, but calls for the removal of the \"root causes\" of the war he launched. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "'You can't make a deal with Russia': Do Ukrainians believe in a ceasefire?",
        "publisher": "BBC News",
        "published_date": "2025-03-15T00:08:45.008Z",
        "article_content": "The BBC has been speaking to people in Kyiv to find out whether people in the Ukrainian capital believe a ceasefire deal could be a step towards ending the war with Russia. Ukraine agreed to a plan for a 30-day ceasefire earlier this week, following talks with the United States. Russia's President Vladimir Putin has since said he agrees with the idea of a ceasefire in Ukraine, but added that \"questions\" remain about the nature of a truce. He also set out a number of tough conditions for peace. Ukrainian President Volodymyr Zelensky has described Putin's response to the plan as \"manipulative\" and called for more sanctions on Russia. Russia launched a full-scale invasion of Ukraine in February 2022, following its annexation of Crimea in 2014, and a war has been ongoing ever since. The comments come as Micheál Martin present US President Donald Trump with a bowl of shamrocks in the White House. Country trio Remember Monday will be representing the UK at the Eurovision Song Contest in 2025. Firefighters in the Czech Republic have been tackling a huge fire after a train derailed. US President Donald Trump claims the US has outspent Europe on aid to Ukraine by over $200bn. BBC Verify's Nick Eardley fact-checks Trump's claims. The far-right Alternative for Germany (AfD) is expected to become the second biggest force in the country. Christian Democrats leader Friedrich Merz thanks those who placed their trust in the party and him. Ihor Brusylo told the BBC's Jeremy Bowen that US President Donald Trump's stance on the war was \"alarming\". A goat in Madrid was rescued by firefighters after it became trapped on a window sill of a tower block. A Ukrainian audience member on BBC Question Time describes her family being divided following Russia's full-scale invasion in 2022. The BBC's Analysis Editor Ros Atkins looks at why the US wants access to Ukraine's minerals. The BBC asked the Russian ambassador if Zelensky standing down is among Russia's demands as a condition of peace. European leaders met at the Elysee Palace in Paris on Monday for an emergency summit on Ukraine. Danielle McLaughlin, 28, from County Donegal, was found dead in the western state of Goa in March 2017. Drone footage shows plumes of smoke and molten lava spewing from Europe's most active volcano. A look from the police cordon in Munich, after a car drove at a group of people, injuring at least 28. The BBC's Defence correspondent breaks down a drastic shift in Washington's position on the war in Ukraine. Speed limits on some roads in the Republic of Ireland will be reduced to 60km/h (37mph) on Friday. After an election win which has been widely criticised as illegitimate, Alexander Lukashenko faced questions from the BBC's Russia editor Steve Rosenberg. Holocaust survivors have been marking 80 years since the liberation of the Nazi concentration camp, Auschwitz. Tens of thousands of people demand action as they gather to remember the victims of Greece's worst railway disaster. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Fierce protests as eight-year-old rape victim dies in Bangladesh",
        "publisher": "BBC News",
        "published_date": "2025-03-14T07:20:04.051Z",
        "article_content": "Warning: This article contains details some readers may find distressing An eight-year-old child who was raped in Bangladesh died of her injuries on Thursday, setting off fierce protests around the country. The girl was raped while visiting her elder sister's house in the city of Magura some time between the night of 5 March and the following morning, according to a case filed by her mother. The elder sister's 18-year-old husband, along with his parents and brother, were arrested and placed on remand. On Thursday night, after hearing news of the child's death, an angry mob descended on the house where the incident is alleged to have taken place, setting it on fire. The girl died at about 13:00 local time (07:00 GMT) on Thursday after suffering three cardiac arrests, according to a statement by the government's Inter-Services Public Relations (ISPR) department. \"Although doctors managed to stabilize the condition twice, the heart failed to restart after the third episode,\" the statement said. She had spent six days in a critical condition at the Combined Military Hospital in the capital Dhaka, after being admitted on 8 March. \"I thought my daughter would survive,\" her mother said following the girl's death, according to local media. \"If she had made it through, I would never have let her go anywhere alone again.\" The girl's body was taken back to Magura in an army helicopter, which landed at the local stadium around 18:00 to fierce protests. Aiyub Ali, officer-in-charge of Magura Sadar Police Station, said that authorities struggled to bring the situation under control, according to local news outlet The Daily Star. Thousands of people gathered in the public square in Magura for the girl's namaz-e-janaza, the Islamic funeral prayer, before she was laid to rest at 19:30. An absentee funeral was also held for the girl at Dhaka University, in the nation's capital, followed by a protest march and speeches by female students. Many protesters demanded that the government expedite justice for rape victims and reform laws related to women and children's safety. Protesters also called for greater clarity around the legal definitions of what constitutes rape in Bangladesh, which they said were currently ambiguous. The trial of the rape and murder case is expected to begin within the next seven days, according to legal advisor Asif Nazrul. \"DNA sample collection has been completed, we hope to get the report within the next five days,\" Mr Nazrul told a press briefing at the Secretariat on Thursday – adding that statements had already been taken from 12 to 13 people. \"If we can start the trial within seven days, our judges will be able to ensure justice with the utmost speed,\" he added. The rape of minors is punishable by death in Bangladesh, as per a law that was passed in 2020. The introduction of that law followed a series of high-profile sexual violence cases, including the brutal gang assault on a 37-year-old woman that was filmed and spread on social media. Less than a week after the rape of the young girl in Magura, media reports emerged of at least three rapes of children of around the same age in different parts of Bangladesh. In some cases the accused were neighbours of the victim, while others were close relatives. According to statistics from the Law and Arbitration Center, 3,438 child rape cases have been filed in Bangladesh in the last eight years, and there have been many more rape victims. At least 539 of them are under the age of six, and 933 are between the ages of seven and twelve. Research has shown that in most cases, children are sexually abused or raped by people they know. Notes on the media in Bangladesh and links to broadcasters and newspapers. Provides an overview of Bangladesh, including key dates and facts about this South Asian nation. Which sides are on course to make the Champions Trophy semi-finals? Who has the most runs? And who has taken the most wickets? The men's Champions Trophy returns in 2025 after a eight-year hiatus - here's the full schedule for the eight-team tournament. The interim leader tells the BBC he's on a learning curve after protests ousted the old government. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "'Their untold stories need to be told': Teens capture India's labourers in pictures",
        "publisher": "BBC News",
        "published_date": "2025-03-15T00:45:38.473Z",
        "article_content": "The elderly woman gazes wistfully into the distance, her hands curled over a basket of tobacco, surrounded by the hundreds of cigarettes she has spent hours rolling by hand. The photograph is one of several snapped by student Rashmitha T in her village in Tamil Nadu, featuring her neighbours who make traditional Indian cigarettes called beedis. \"No-one knows about their work. Their untold stories need to be told,\" Rashmitha told the BBC. Her pictures were featured in a recent exhibition about India's labourers titled The Unseen Perspective at the Egmore Museum in Chennai. All the photographs were taken by 40 students from Tamil Nadu's government-run schools, who documented the lives of their own parents or other adults. From quarry workers to weavers, welders to tailors, the pictures highlight the diverse, backbreaking work undertaken by the estimated 400 million labourers in India. Many beedi rollers, for instance, are vulnerable to lung damage and tuberculosis due to their dangerous work, said Rashmitha. \"Their homes reek of tobacco, you cannot stay there long,\" she said, adding that her neighbours sit outside their homes for hours rolling beedis. For every 1,000 cigarettes they roll, they only earn 250 rupees ($2.90; £2.20), she told the BBC. In the state's Erode district, Jayaraj S captured a photo of his mother Pazhaniammal at work as a brick maker. She is seen pouring a clay and sand mixture into moulds and shaping bricks by hand. Jayaraj had to wake up at 2am to snap the picture, because his mother begins working in the middle of the night. \"She has to start early to avoid the afternoon sun,\" he said. It was only when he embarked on his photography project that he truly realised the hardships she has to endure, he added. \"My mother frequently complains of headaches, leg pain, hip pain and sometimes faints,\" he said. In the Madurai district, Gopika Lakshmi M captured her father Muthukrishnan selling goods from an old van. Her father has to get a dialysis twice a week after he lost a kidney two years ago. \"He drives to nearby villages to sell goods despite being on dialysis,\" Lakshmi says. \"We don't have the luxury of resting at home.\" But despite his serious condition, her father \"looked like a hero\" as he carried on with his gruelling daily routine, said Gopika. Taking pictures with a professional camera was not easy initially, but it got easier after months of training with experts, said the students. \"I learned how to shoot at night, adjust shutter speed and aperture,\" said Keerthi, who lives in the Tenkasi district. For her project, Keerthi chose to document the daily life of her mother, Muthulakshmi, who owns a small shop in front of their house. \"Dad is not well, so mum looks after both the shop and the house,\" she said. \"She wakes up at 4am and works until 11pm.\" Her photos depict her mother's struggles as she travels long distances via public buses to source goods for her store. \"I wanted to show through photographs what a woman does to improve her children's lives,\" she said. Mukesh K spent four days with his father, documenting his work at a quarry. \"My father stays here and comes home only once a week,\" he said. Mukesh's father works from 3am till noon, and after a brief rest, works from 3pm to 7pm. He earns a meagre sum of about 500 rupees a day. \"There are no beds or mattresses in their room. My father sleeps on empty cardboard boxes in the quarry,\" he said. \"He suffered a sunstroke last year because he was working under the hot sun.\" The students, aged 13 to 17, are learning various art forms, including photography, as part of an initiative by the Tamil Nadu School education department. \"The idea is to make students socially responsible,\" said Muthamizh Kalaivizhi, state lead of Holistic Development programme in Tamil Nadu's government schools and founder of non-government organisation Neelam Foundation. \"They documented the working people around them. Understanding their lives is the beginning of social change,\" he added. Follow BBC News India on Instagram, YouTube, X and Facebook. The shipping firm has collected images from guests, staff and newspaper archives to mark 185 years. A partial lunar eclipse is captured as spring is springing across the county in this roundup of photos. Some fantastic sights captured in images taken across the county this week. It starts nearly 40 years ago, when a teenage girl is pulled out of obscurity and thrust into the spotlight. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "US influencer who snatched baby wombat has left Australia",
        "publisher": "BBC News",
        "published_date": "2025-03-14T07:58:14.978Z",
        "article_content": "Sam Jones, a US influencer who briefly snatched a baby wombat from its distressed mother, and uploaded the footage to social media has left Australia. Australia's Home Affairs minister Tony Burke had earlier said his department was reviewing whether it could revoke Ms Jones's visa, but the BBC understands that she left the country of her own accord. \"There has never been a better time to be a baby wombat,\" Burke said in a short statement on Friday celebrating Jones's departure. Anger erupted across Australia after Jones posted a video of her taking a baby wombat from the side of a road while laughing and running away from the distraught mother wombat. The video also shows the baby wombat hissing in distress before Jones then returns it to the bush. Jones, who also goes by the name Samantha Strable, has nearly 100,000 followers and describes herself as an \"outdoor enthusiast and hunter\" on her Instagram profile. She has since made her account private and deleted her post. Her video was swiftly met with widespread condemnation, with Australian Prime Minister Anthony Albanese calling the incident an \"outrage\". Foreign Minister Penny Wong called the video \"dreadful\". On Friday, opposition leader Peter Dutton said he thought it was \"a cruel act\" and that he was \"glad\" the influencer has now left. An online petition demanding Jones be deported from Australia garnered more than 30,000 signatures. However, as Jones had not been charged nor been deemed a threat to the country – the government may not have had any grounds to cancel her visa. In since-deleted comments, Jones said \"the baby was carefully held for one minute in total and then released back to mom\". \"They wandered back off into the bush together completely unharmed,\" she wrote. \"I don't ever capture wildlife that will be harmed by my doing so.\" But wildlife experts have deemed Jones's act a \"blatant disregard\" for native wildlife. The Wombat Protection Society said it was shocked to see the \"mishandling of a wombat joey in an apparent snatch for 'social media likes'\". Suzanne Milthorpe, Head of Campaigns at World Animal Protection Australia, told BBC Newsday that posting such a video for \"cheap content\" was \"unacceptable\". \"To that baby it must have seemed like a giant predator was picking it up and taking it away,\" she said. Wombats, which are native to Australia, are a legally protected species across the country. Baby wombats share a strong bond with their mothers, and any separation can be distressing and harmful, conservationists say. A new TikTok account claiming to be Jones after her original account was allegedly banned, published a post on Thursday saying that \"the hate is currently too much for me to handle\" and that there had been \"hundreds\" of death threats. \"Imagine someone just goes up to your child and curses at them? Let's have some respect,\" the post said. Most, however, have remained critical of Jones's act. \"Maybe imagine if someone picked up your child and laughed while you screamed for them to give them back,\" read a comment under the post, a reference to Jones's snatching of the wombat from its mother. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "USAID kept them alive - then Trump's cuts came",
        "publisher": "BBC News",
        "published_date": "2025-03-14T00:34:35.536Z",
        "article_content": "When Kajol contracted tuberculosis in January, USAID kept her alive. Now she and her family are in danger again after the Trump administration ordered most US aid spending to end. TB can be fatal if left untreated. The highly contagious bacterial disease, which usually infects the lungs, is not prevalent in rich countries, because treatment is relatively cheap. But in Bangladesh, it is a scourge. That's especially so in neighbourhoods such as Mohammadpur, a slum in the capital Dhaka where Kajol,17, lives. \"We are poor people,\" she says. She is the sole breadwinner for herself, her mother and little brother. Her job in a garment factory keeps them all afloat. So when she fell ill in January, it could have been catastrophic. Instead, help arrived through Dipa Halder. For the last three years, she has been canvassing the residents of Mohammadpur about TB and getting people the treatment they so desperately need, free of cost. The initiative, which gets people tested and get them treatment they need including proper nutrition, is run by a local aid organisation, Nari Maitree. It was funded by the US Agency for International Aid (USAID) until February, when it received a letter from the US government saying the funds had been terminated. That brought Kajol's treatment, only partially completed, to an abrupt end. Cutting off medicines mid-treatment makes the chances of TB becoming drug-resistant much greater. It makes the disease much more difficult to combat and puts patients at greater risk of severe illness and death. The government provides free medication but getting diagnosed and collecting the medicines can be cost prohibitive for many. \"Now I have to go get the medicine myself,\" she says. \"I am struggling a lot.\" \"The people here are quite vulnerable,\" says Dipa, 21. \"I can tell them to go to a particular doctor, which would help them save some money. \"Or I try to provide them with some financial assistance from our organisation so that they can continue their treatment.\" According to a US government performance report seen by the BBC, support by USAID in 2023 resulted directly in the identification and reporting of more than a quarter of a million new cases of TB in Bangladesh. In the same year, there were 296,487 new or relapse cases of TB which were cured or successfully completed as a result of USAID. The agency was seen as integral to the country's fight against tuberculosis. \"You ask people on the street, they will say yeah, it's the US, they are the ones that are keeping it [tuberculosis] in control,\" said a director of a USAID project in Bangladesh, who is not authorised to speak publicly and did not want to be named. \"Bangladesh was USAID's largest programme in Asia,\" says Asif Saleh, executive director of the non-profit BRAC organisation. \"In terms of its impact, particularly in the healthcare sector, it has been massive. \"Particularly around vaccination, reducing child mortality and maternal mortality, USAID has played a massive role in this country.\" In 2024, Bangladesh received $500m in foreign assistance. This year, that amount has cratered to $71m. To put that number into context, in the three-year period from 2021-2023, USAID committed an average of $83m annually in Bangladesh for health initiatives alone, including combating TB. Cuts to USAID have meant Nari Maitree can no longer offer its Stop TB Program, but it also means Dipa is out of work. She supports her elderly parents and her younger sister. \"I am completely shattered now that I lost my job. I am carrying the burden of the family. Being unemployed is a devastating situation,\" she told the BBC. In a document seen by the BBC, 113 programmes that were funded directly by the USAID office in Bangladesh have stopped. The list does not include the myriad programmes that are funded directly by US agencies in Washington. \"The NGO sector [In Bangladesh] employs 500,000 people at least,\" says Mr Saleh. \"It's huge. Thousands and thousands of jobs are going to be eliminated.\" It's not just the United States that is moving away from foreign aid. The UK has announced cuts to its foreign assistance programmes, as has Switzerland. It is likely that other countries may follow suit. It's a sobering reality for Bangladesh. The country's government was overthrown last year and the economy is shaky, with inflation near 10% and a jobs crisis, particularly among young people. Interim leader Muhammad Yunus says Bangladesh will come up with a new strategy on how to survive following the aid cuts – but doesn't say how. When pressed in a BBC interview on how the country will cover the shortfall from USAID, Yunus said: \"It was a small part, not a big deal. It doesn't mean Bangladesh will disappear from the map.\" Asif Saleh says the way the cuts have been implemented has been abrupt and chaotic. The impact on a country like Bangladesh is immeasurable. Nowhere is that more clear than in Cox's Bazar, a coastal city in south-eastern Bangladesh, home to the world's largest refugee camp. More than one million Rohingya, a persecuted Muslim minority community that the United Nations calls victims of ethnic cleansing, fled violent purges in their home country, neighbouring Myanmar. Unable to go back home and unable to work outside the refugee camp, the Rohingya depend on international aid for their survival. The United States contributed almost half of all aid to Rohingya refugees. \"We have run out of soap,\" says Rana Flowers, country representative for the UN children's agency Unicef. \"We are now having to truck water into the camps. It's an absolutely critical time. There is an outbreak of cholera with over 580 cases, along with a scabies outbreak.\" Water sanitation projects in the camps used to be funded by USAID. Since the order to stop work went into effect at the end of January, hospitals such as the International Red Cross hospital in Cox's Bazar are reduced to providing emergency assistance only. Any hope the money would be reinstated was crushed this week, when the Trump administration cancelled more than 80% of all the programmes at USAID.  Patients like Hamida Begum, who was getting regular treatment for hypertension, are left with few options. \"I'm old and I don't have anyone to help me,\" she says. Her husband died last year, leaving her to care for her four children alone, including her 12-year-old daughter who cannot walk. \"I cannot go to another hospital far from home because of my daughter.\" At a nearby UN food distribution centre, Rehana Begum is standing beside two large sacks. Inside, she says, are six litres of cooking oil and 13kg of rice, along with basics such as onions, garlic and dried chillies. These rations, given to her by the World Food Programme (WFP), need to last her and her family a month. I ask how she will manage now that her rations will be cut in half beginning next month. She looked shocked. Then she started to cry. \"How can we possibly survive with such a small amount?\" asks Rehana, 47, who shares one room with her husband and five children. \"Even now, it is difficult to manage.\" The WFP says it was forced to make the drastic cut because of \"a critical funding shortfall for its emergency response operations\". The rations now being allotted to the Rohingya community will only meet their basic daily dietary needs, igniting fears they will be left with just enough to live and not much more. \"This is an absolute disaster in the making,\" says Rana Flowers of Unicef. \"Desperate frustrated people within the camps will lead to security concerns. If that escalates to the degree it could, we won't be able to go into the camps to help.\" Three Cambridgeshire men drive for days in a green truck named Shrek to deliver aid to the country. Humanitarian organisations have warned that the end of USAID programmes is already impacting millions. Notes on the media in Bangladesh and links to broadcasters and newspapers. Provides an overview of Bangladesh, including key dates and facts about this South Asian nation. Which sides are on course to make the Champions Trophy semi-finals? Who has the most runs? And who has taken the most wickets? Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Clothes brand gets 100 complaints a day that models are 'too fat'",
        "publisher": "BBC News",
        "published_date": "2025-03-14T22:29:02.918Z",
        "article_content": "The boss of online clothing brand Snag has told the BBC it gets more than 100 complaints a day that the models in its adverts are \"too fat\". Chief executive Brigitte Read says models of her size 4-38 clothing are frequently the target of \"hateful\" posts about their weight. The brand was cited in an online debate over whether adverts showing \"unhealthily fat\" models should be banned after a Next advert, in which a model appeared \"unhealthily thin\", was banned. The UK's advertising watchdog says it has banned ads using models who appear unhealthily underweight rather than overweight due to society's aspiration towards thinness. The Advertising Standards Authority (ASA) received 61 complaints about models' weight in 2024, with the vast majority being about models who appeared to be too thin. But it only had grounds to investigate eight complaints and none were about Snag. Catherine Thom read the BBC report about the Next advert ban and got in touch to say she found it \"hypocritical to ban adverts where models appear too thin for being socially irresponsible, however when models are clearly obese we're saying it's body positivity\". The 36-year-old from Edinburgh was one of several people who contacted the BBC with this view, while a Reddit thread had more than 1,000 comments with many along the same theme. Mrs Thom says she was \"bombarded with images of obese girls in tights\" after buying from Snag when she was pregnant. \"I see Snag tights plastering these morbidly obese people all over social media,\" she says. \"How is that allowed when the photo of the Next model isn't? There should be fairness, not politically correct body positivity. Adverts normalising an unhealthy weight, be it obese or severely underweight, are equally as harmful.\" But Snag founder Ms Read says: \"Shaming fat people does not help them to lose weight and actually it really impacts mental health and therefore their physical health.\" She thinks the idea of banning adverts showing models with bigger bodies is a symptom of society's \"fat phobia\". Of her 100 staff, 12 are dedicated \"just to remove negative comments and big up those promoting body positivity\". \"Fat people exist, they're equally as valid as thin people, they buy clothes and they need to see what they look like on people that look like them,\" she says. \"You are not worth less the bigger you are. Models of all sizes, shapes, ethnicities and abilities are valid and should be represented.\" Sophie Scott is a 27-year-old salon owner from Lossiemouth in Scotland who has modelled for Snag, and received positive and negative comments about her size on social media. \"I get either 'you're so beautiful' or 'you need to lose weight'. When I started modelling I was a size 30. Having lost weight since then I'm still on the receiving end of hate comments because it will never be enough for some people.\" Sophie is used to online comments telling her she is \"unhealthy\", but says, \"fitness is not measured by the way you look. They are making assumptions, they don't know me or my activity levels. \"People say 'you're glorifying obesity' but I don't think anyone is looking at me and saying 'I want to look like that'. Perhaps some people are looking at me and saying 'she has a similar body type to me'. \"When I get a message from someone saying 'we are the same size and you've inspired me to wear what I want', it takes away from every hate comment I get. \"If I've helped one person accept their body then the hate comments don't really bother me.\" Fashion journalist Victoria Moss believes the \"depressing\" debate shows society is not used to seeing bigger bodies in advertising campaigns. \"You'd be pretty hard pushed to find genuine plus-size models on retailers' websites because even a mid-size is a 10/12 and plus is 14/16 which is actually around the average size for a woman in the UK,\" she says. \"The issue with adverts showing very small or very big models is the context and the provocation. We know people with eating disorders seek out images of very thin people as 'thinspiration'. But if anyone sees a picture of a bigger person they're not going to drive to buy 10 McDonald's to try to get fatter.\" Jess Tye at the ASA told the BBC the watchdog gets about 35,000 complaints a year about all advertising, and in 2024 received 61 complaints about 52 adverts relating to the model's weight. She says an advert will be investigated if it could be seen to be encouraging people to aspire to an unhealthy body weight. Adverts simply promoting body confidence and using a model who is relevant to the product's size range would not be investigated. \"It's to do with the wider societal context. We know in the UK currently society tends to view thinness as aspirational and that's not the case for being overweight.\" Kirsty Wark's new show puts Scotland's fashion credentials under the spotlight. Versace took over the Italian fashion house after her brother's untimely death and made it her own. The woman, in her 60s, was found unconscious at her home by the Asda driver. Versace is facing a creative shift as Prada looks to potentially buy the Italian fashion house. Giving away food will be trialled in some Express stores in an effort to cut waste. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "As if! Cult 90s film Clueless gets musical makeover",
        "publisher": "BBC News",
        "published_date": "2025-03-15T00:13:30.597Z",
        "article_content": "Cher Horowitz has brought her life of Beverly Hills high fashion, friendship and matchmaking to London's West End, as classic 1990s teen film Clueless has been given a musical makeover. Clueless has been brought to the stage by the film's original writer and director Amy Heckerling - who says keeping the 90s theme was integral to the show. Heckerling insists she has \"no interest in being modern\" - which will come as a relief to the audiences who grew up quoting \"As if!\" and aspiring to Cher's plaid and Prada-filled wardrobe. The story follows the life of the naïve and lovably spoiled teenager, who plays matchmaker with her friends before ultimately finding love herself. An adaption of Jane Austen's Emma, Clueless captured the teen spirit of the 90s and inspired countless school dramas like Mean Girls, Gossip Girl and Legally Blonde. The stage version has songs in the form of an original score by singer-songwriter KT Tunstall. Speaking to the BBC, Tunstall says the film was \"omnipotent\" in the 90s and influenced everything from the clothes people wore to the music people listened to. The Scottish singer, best known for songs like Black Horse and the Cherry Tree and Suddenly I See, says working on the show was a \"dream project\". She says the original soundtrack was a big inspiration, and describes the music as \"a mixtape of all your favourite 90s bangers\". The process of creating the soundtrack for Clueless: The Musical was intense for Tunstall, who says it's no easy feat to add music to an adaptation of a film that didn't originally have it. \"You really have to think about whether a song fits the structure and flow of the story and whether it actually helps the audience understand the narrative better,\" she says. Heckerling says she actually wishes the film had been a musical because \"there were natural moments in the script where characters could have sung\". \"Those types of films weren't very common in the 90s but I'm glad we could add in music now,\" she says. Critics had mixed thoughts about the new songs - the Guardian called them \"disappointingly flat-footed\" in a two-star review and said the lyrics \"too often serve as exposition rather than raising the emotional drama\". Similarly, the Telegraph's Dominic Cavendish wrote that the show has \"numbers designed to sound in keeping with the period but which are so generic they don't ring with real-world authenticity\". But What'sOnStage praised Tunstall's \"infuriatingly catchy tunes\" and Glenn Slater's \"nifty, witty lyrics\". For Emma Flynn, who is making her West End debut as Cher, the music has another important function in the show - it allows characters to easily share their inner thoughts with the audience. \"In the film you hear these really funny inner monologues of Cher, but the great thing about this show is you can hear all of the character's thoughts, which makes you feel more connected to them.\" Flynn has been praised by critics, with the Evening Standard noting her \"powerfully-sung breakout performance\" and describing it as channelling \"both Alicia Silverstone in the original movie and Sabrina Carpenter today, while making the role entirely her own\". Co-star Keelan McAuley, who plays nerdy Josh, tells the BBC he loves the play's nostalgia factor. \"The flip phone was the most advanced technology they had in the 90s and there's something so enchanting about a time where there was no access to social media,\" he says. The show stays almost entirely true to the 1995 film, with everyone sporting the latest 90s fashions, carrying a glitzy pager, and listening to angsty teen bangers on a Walkman. While it may feel like a nostalgia fest, Heckerling admits she doesn't \"like to stick to real life\", and even her sunny film was far from the reality of what the 90s were like for most teenagers in LA, with race riots and other political problems. The Independent's three-star review says the show \"sticks to the original movie like chewing gum to the underside of a school desk\" at first, but changes tack by the second half. \"[Director Rachel] Kavanaugh and Heckerling gain the confidence to part ways a bit from the movie's script, and to let the story's heart show,\" Alice Saville wrote. For Tunstall, what sets Clueless apart from traditional rom-coms and high school dramas is that there isn't a typical villain and there's no nastiness or bad intentions from the main characters. Jane Austen famously thought her main character wouldn't be a widely liked heroine, but Tunstall says she is often people's favourite character because of her honesty and depth. \"People can relate to her on a deeper level, like how she is trying to process the death of her mother and help keep her family in order. \"Those themes are universal and that's what makes this story so enduring.\" The festival aims to \"to put the South West on the map\", organisers say. Cult classic Blue Juice is still wowing audiences in Cornwall, 30 years after its first release. Find out everything you need to know about Manchester's festival for filmmakers and film lovers. Laura Carreira's film 'On Falling' explores the insecurity and pressures of migrant working life. The film was shot and edited by Sean Smith, 18, and directed by his uncle, Raymond Mouzon. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "It's not a competition! The collaborative video game genre loved by players",
        "publisher": "BBC News",
        "published_date": "2025-03-15T00:14:25.847Z",
        "article_content": "Think of video games, and you'll probably think of something competitive. Some of the most popular titles in the world, such as Fortnite and Call of Duty, are focused on outgunning, outrunning or outclassing opponents. But, as Josef Fares and his studio Hazelight have shown, that's not the only thing gamers want. His latest, Split Fiction, is a collaborative experience where two players work together to solve puzzles and beat obstacles. The adventure game has received rave reviews, sold one million copies in 48 hours and is currently among the most-watched titles on streaming platform Twitch. It's not a one-off. His previous title, It Takes Two, featured similar \"couch co-op\" gameplay and sold 20 million copies and won a Game of the Year Award. What draws players to these friendlier experiences? A report from analytics company Midia Research found that couch co-op was especially popular among people aged 16 to 24. It surveyed 9,000 gamers worldwide, and said roughly 40% of respondents in the age range reported it was their preferred way to play. The report said \"social play is a key part of gaming for younger consumers,\" and suggested more developers could look to incorporate collaborative elements. Co-operative games are also big with streamers - watching players bicker as they try to conquer a new title is a great source of viral moments. Last year Chained Together, where players work together to escape the depths of hell, was a hit thanks to huge names like Kai Cenat and IShowSpeed getting in on the action. Couple Melissa and John, from Middlesbrough, have been uploading clips of themselves playing Split Fiction together to TikTok. The game centres around fantasy author Zoe and sci-fi writer Mio, who become trapped in simulated versions of their own stories. Melissa, a keen reader, says the plot appealed to her, but the chance to team up got her invested. \"A lot of the time when you play video games you are isolated from other people and it's just nice to be together, spend that quality time together,\" Melissa tells Newsbeat. John says popular online games are often very competitive, which can be stressful. \"I don't want to have to come home tired and have to focus 100% to just be able to do ok at a game,\" he says. \"Whereas this one, I can just sit back, relax and just enjoy the experience.\" What Hazelight does is unique, but other companies do implement co-op features into their titles. Guildford-based Supermassive Games, which specialises in \"interactive horror movies\", made couch co-op a standard mode in its titles after publishing its breakout hit Until Dawn. They found players were going through the single-player title in groups, passing the pad between them as the narrative - which changes based on choices made in-game - progressed. Competitive social play is also popular. Some of the best-selling games on Nintendo's Switch system - Mario Kart 8 and the Mario Party series - are frequently played with mates around the TV. In recent years, developers have tried to replicate the success of games like Fortnite - so-called \"live service\" titles that constantly update and retain players for months, if not years. If you get it right, the potential financial rewards are huge, but cutting through in a saturated market is difficult. And as the video games industry continues to deal with mass layoffs, studio closures and decreased spending on premium games, not many publishers want to take a risk. Josef believes there may be too much focus on the bottom line. \"Publishers need to step up and really trust the developer,\" he says. \"But also developers, I think, need to have a clear vision and stick with what they believe in.\" He does admit, though, that not everyone has his studio's history, nor his personality. \"I am a - what do you say? - a different breed,\" says Josef. When he was directing his first game, Brothers: A Tale of Two Sons, feedback from some early playtests was \"super bad\". \"I'm like, they're wrong, they're wrong, because I know it's great,\" he says. He's spoken before about resisting pressure to put micro-transactions - in-game purchases - in his projects, and is uncompromising despite his studio's close relationship with EA, one of the world's biggest publishers. \"I don't expect everybody to be like me, but that's me with my extreme confidence,\" he says. \"What we do, I love it. \"We're sticking to the vision of what we believe in. Stick with the vision, go with it. \"And I think if you really love what you do people love it as well.\" Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here. The spacecraft will arrive at the International Space Station this weekend and is meant to return Butch Wilmore and Suni Williams home. Iranian officials are encouraging people to report women who refuse to obey the Islamic republic's dress code, according to a UN report. The former Google and Yahoo executive believes AI should simplify our lives. The BBC understands the dispute over accessing encrypted data is set to be heard at the High Court. In Tulsi, a village in central India, social media has sparked an economic and social revolution. It's a microcosm of YouTube's effect on the world. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "USAID kept them alive - then Trump's cuts came",
        "publisher": "BBC News",
        "published_date": "2025-03-14T00:34:35.536Z",
        "article_content": "When Kajol contracted tuberculosis in January, USAID kept her alive. Now she and her family are in danger again after the Trump administration ordered most US aid spending to end. TB can be fatal if left untreated. The highly contagious bacterial disease, which usually infects the lungs, is not prevalent in rich countries, because treatment is relatively cheap. But in Bangladesh, it is a scourge. That's especially so in neighbourhoods such as Mohammadpur, a slum in the capital Dhaka where Kajol,17, lives. \"We are poor people,\" she says. She is the sole breadwinner for herself, her mother and little brother. Her job in a garment factory keeps them all afloat. So when she fell ill in January, it could have been catastrophic. Instead, help arrived through Dipa Halder. For the last three years, she has been canvassing the residents of Mohammadpur about TB and getting people the treatment they so desperately need, free of cost. The initiative, which gets people tested and get them treatment they need including proper nutrition, is run by a local aid organisation, Nari Maitree. It was funded by the US Agency for International Aid (USAID) until February, when it received a letter from the US government saying the funds had been terminated. That brought Kajol's treatment, only partially completed, to an abrupt end. Cutting off medicines mid-treatment makes the chances of TB becoming drug-resistant much greater. It makes the disease much more difficult to combat and puts patients at greater risk of severe illness and death. The government provides free medication but getting diagnosed and collecting the medicines can be cost prohibitive for many. \"Now I have to go get the medicine myself,\" she says. \"I am struggling a lot.\" \"The people here are quite vulnerable,\" says Dipa, 21. \"I can tell them to go to a particular doctor, which would help them save some money. \"Or I try to provide them with some financial assistance from our organisation so that they can continue their treatment.\" According to a US government performance report seen by the BBC, support by USAID in 2023 resulted directly in the identification and reporting of more than a quarter of a million new cases of TB in Bangladesh. In the same year, there were 296,487 new or relapse cases of TB which were cured or successfully completed as a result of USAID. The agency was seen as integral to the country's fight against tuberculosis. \"You ask people on the street, they will say yeah, it's the US, they are the ones that are keeping it [tuberculosis] in control,\" said a director of a USAID project in Bangladesh, who is not authorised to speak publicly and did not want to be named. \"Bangladesh was USAID's largest programme in Asia,\" says Asif Saleh, executive director of the non-profit BRAC organisation. \"In terms of its impact, particularly in the healthcare sector, it has been massive. \"Particularly around vaccination, reducing child mortality and maternal mortality, USAID has played a massive role in this country.\" In 2024, Bangladesh received $500m in foreign assistance. This year, that amount has cratered to $71m. To put that number into context, in the three-year period from 2021-2023, USAID committed an average of $83m annually in Bangladesh for health initiatives alone, including combating TB. Cuts to USAID have meant Nari Maitree can no longer offer its Stop TB Program, but it also means Dipa is out of work. She supports her elderly parents and her younger sister. \"I am completely shattered now that I lost my job. I am carrying the burden of the family. Being unemployed is a devastating situation,\" she told the BBC. In a document seen by the BBC, 113 programmes that were funded directly by the USAID office in Bangladesh have stopped. The list does not include the myriad programmes that are funded directly by US agencies in Washington. \"The NGO sector [In Bangladesh] employs 500,000 people at least,\" says Mr Saleh. \"It's huge. Thousands and thousands of jobs are going to be eliminated.\" It's not just the United States that is moving away from foreign aid. The UK has announced cuts to its foreign assistance programmes, as has Switzerland. It is likely that other countries may follow suit. It's a sobering reality for Bangladesh. The country's government was overthrown last year and the economy is shaky, with inflation near 10% and a jobs crisis, particularly among young people. Interim leader Muhammad Yunus says Bangladesh will come up with a new strategy on how to survive following the aid cuts – but doesn't say how. When pressed in a BBC interview on how the country will cover the shortfall from USAID, Yunus said: \"It was a small part, not a big deal. It doesn't mean Bangladesh will disappear from the map.\" Asif Saleh says the way the cuts have been implemented has been abrupt and chaotic. The impact on a country like Bangladesh is immeasurable. Nowhere is that more clear than in Cox's Bazar, a coastal city in south-eastern Bangladesh, home to the world's largest refugee camp. More than one million Rohingya, a persecuted Muslim minority community that the United Nations calls victims of ethnic cleansing, fled violent purges in their home country, neighbouring Myanmar. Unable to go back home and unable to work outside the refugee camp, the Rohingya depend on international aid for their survival. The United States contributed almost half of all aid to Rohingya refugees. \"We have run out of soap,\" says Rana Flowers, country representative for the UN children's agency Unicef. \"We are now having to truck water into the camps. It's an absolutely critical time. There is an outbreak of cholera with over 580 cases, along with a scabies outbreak.\" Water sanitation projects in the camps used to be funded by USAID. Since the order to stop work went into effect at the end of January, hospitals such as the International Red Cross hospital in Cox's Bazar are reduced to providing emergency assistance only. Any hope the money would be reinstated was crushed this week, when the Trump administration cancelled more than 80% of all the programmes at USAID.  Patients like Hamida Begum, who was getting regular treatment for hypertension, are left with few options. \"I'm old and I don't have anyone to help me,\" she says. Her husband died last year, leaving her to care for her four children alone, including her 12-year-old daughter who cannot walk. \"I cannot go to another hospital far from home because of my daughter.\" At a nearby UN food distribution centre, Rehana Begum is standing beside two large sacks. Inside, she says, are six litres of cooking oil and 13kg of rice, along with basics such as onions, garlic and dried chillies. These rations, given to her by the World Food Programme (WFP), need to last her and her family a month. I ask how she will manage now that her rations will be cut in half beginning next month. She looked shocked. Then she started to cry. \"How can we possibly survive with such a small amount?\" asks Rehana, 47, who shares one room with her husband and five children. \"Even now, it is difficult to manage.\" The WFP says it was forced to make the drastic cut because of \"a critical funding shortfall for its emergency response operations\". The rations now being allotted to the Rohingya community will only meet their basic daily dietary needs, igniting fears they will be left with just enough to live and not much more. \"This is an absolute disaster in the making,\" says Rana Flowers of Unicef. \"Desperate frustrated people within the camps will lead to security concerns. If that escalates to the degree it could, we won't be able to go into the camps to help.\" Three Cambridgeshire men drive for days in a green truck named Shrek to deliver aid to the country. Humanitarian organisations have warned that the end of USAID programmes is already impacting millions. Notes on the media in Bangladesh and links to broadcasters and newspapers. Provides an overview of Bangladesh, including key dates and facts about this South Asian nation. Which sides are on course to make the Champions Trophy semi-finals? Who has the most runs? And who has taken the most wickets? Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "It's not a competition! The collaborative video game genre loved by players",
        "publisher": "BBC News",
        "published_date": "2025-03-15T00:14:25.847Z",
        "article_content": "Think of video games, and you'll probably think of something competitive. Some of the most popular titles in the world, such as Fortnite and Call of Duty, are focused on outgunning, outrunning or outclassing opponents. But, as Josef Fares and his studio Hazelight have shown, that's not the only thing gamers want. His latest, Split Fiction, is a collaborative experience where two players work together to solve puzzles and beat obstacles. The adventure game has received rave reviews, sold one million copies in 48 hours and is currently among the most-watched titles on streaming platform Twitch. It's not a one-off. His previous title, It Takes Two, featured similar \"couch co-op\" gameplay and sold 20 million copies and won a Game of the Year Award. What draws players to these friendlier experiences? A report from analytics company Midia Research found that couch co-op was especially popular among people aged 16 to 24. It surveyed 9,000 gamers worldwide, and said roughly 40% of respondents in the age range reported it was their preferred way to play. The report said \"social play is a key part of gaming for younger consumers,\" and suggested more developers could look to incorporate collaborative elements. Co-operative games are also big with streamers - watching players bicker as they try to conquer a new title is a great source of viral moments. Last year Chained Together, where players work together to escape the depths of hell, was a hit thanks to huge names like Kai Cenat and IShowSpeed getting in on the action. Couple Melissa and John, from Middlesbrough, have been uploading clips of themselves playing Split Fiction together to TikTok. The game centres around fantasy author Zoe and sci-fi writer Mio, who become trapped in simulated versions of their own stories. Melissa, a keen reader, says the plot appealed to her, but the chance to team up got her invested. \"A lot of the time when you play video games you are isolated from other people and it's just nice to be together, spend that quality time together,\" Melissa tells Newsbeat. John says popular online games are often very competitive, which can be stressful. \"I don't want to have to come home tired and have to focus 100% to just be able to do ok at a game,\" he says. \"Whereas this one, I can just sit back, relax and just enjoy the experience.\" What Hazelight does is unique, but other companies do implement co-op features into their titles. Guildford-based Supermassive Games, which specialises in \"interactive horror movies\", made couch co-op a standard mode in its titles after publishing its breakout hit Until Dawn. They found players were going through the single-player title in groups, passing the pad between them as the narrative - which changes based on choices made in-game - progressed. Competitive social play is also popular. Some of the best-selling games on Nintendo's Switch system - Mario Kart 8 and the Mario Party series - are frequently played with mates around the TV. In recent years, developers have tried to replicate the success of games like Fortnite - so-called \"live service\" titles that constantly update and retain players for months, if not years. If you get it right, the potential financial rewards are huge, but cutting through in a saturated market is difficult. And as the video games industry continues to deal with mass layoffs, studio closures and decreased spending on premium games, not many publishers want to take a risk. Josef believes there may be too much focus on the bottom line. \"Publishers need to step up and really trust the developer,\" he says. \"But also developers, I think, need to have a clear vision and stick with what they believe in.\" He does admit, though, that not everyone has his studio's history, nor his personality. \"I am a - what do you say? - a different breed,\" says Josef. When he was directing his first game, Brothers: A Tale of Two Sons, feedback from some early playtests was \"super bad\". \"I'm like, they're wrong, they're wrong, because I know it's great,\" he says. He's spoken before about resisting pressure to put micro-transactions - in-game purchases - in his projects, and is uncompromising despite his studio's close relationship with EA, one of the world's biggest publishers. \"I don't expect everybody to be like me, but that's me with my extreme confidence,\" he says. \"What we do, I love it. \"We're sticking to the vision of what we believe in. Stick with the vision, go with it. \"And I think if you really love what you do people love it as well.\" Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here. The spacecraft will arrive at the International Space Station this weekend and is meant to return Butch Wilmore and Suni Williams home. Iranian officials are encouraging people to report women who refuse to obey the Islamic republic's dress code, according to a UN report. The former Google and Yahoo executive believes AI should simplify our lives. The BBC understands the dispute over accessing encrypted data is set to be heard at the High Court. In Tulsi, a village in central India, social media has sparked an economic and social revolution. It's a microcosm of YouTube's effect on the world. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Mark Carney sworn in as first new Canadian prime minister in nine years",
        "publisher": "BBC News",
        "published_date": "2025-03-14T21:52:47.001Z",
        "article_content": "Mark Carney, an economist and political newcomer, has been sworn in as Canada's new prime minister, and delivered remarks vowing to \"never\" become a part of the United States. He took office on Friday just days after being elected leader of the governing Liberal Party and amid an ongoing trade war with US President Donald Trump. \"We know that by building together, we can give ourselves far more than anyone else can take away,\" he said after the ceremony. Carney replaces outgoing Prime Minister Justin Trudeau, who was in office for nine years, after a landslide victory in last week's Liberal leadership race. \"We will never, in any shape or form, be part of the US,\" Carney told reporters in Ottawa on Friday, referring to Trump's musings that Canada join the US as its \"51st state\". \"We are very fundamentally a different country,\" he said, later adding the notion is \"crazy\". He declined to answer questions about the timing of Canada's next federal election - currently scheduled for October - but hinted he would move quickly to seek \"as strong a mandate that is needed for the time\". In his first order as prime minister, Carney moved to end a policy that had been frequent attacked against by political opponents. He ended the consumer carbon pricing programme - a key environmental policy under Trudeau that had become deeply unpopular in recent years amid high inflation. Conservatives have criticised the tax, saying it raised the price of goods and energy for Canadian families. At an afternoon cabinet meeting, Carney said his government will still take steps to fight climate change. An industrial carbon tax on large emitters remains in place. Canadians receive a rebate to offset the cost of carbon pricing and will get their final cheque in April. Canadian politics in recent months have largely been overshadowed by the trade war Trump launched after taking office in January - and with a general election on the horizon, Carney is expected to pitch himself as the candidate best equipped to take on Trump. He previously held roles as governor of the Bank of Canada, the country's central bank, and of the Bank of England, and helped both countries weather major financial disruption. He intends to travel to the UK and France as his first foreign trip as PM next week. Carney said he also looks forward to speaking with Trump. \"We respect the United States. We respect President Trump,\" he said. \"President Trump is has put some very important issues at the top of his agenda.\" Carney has promised to uphold Canada's reciprocal tariffs on specific American goods for as long as Trump maintains 25% universal tariffs on Canadian goods not  covered by the Canada-United States-Mexico Agreement (CUSMA) trade deal. Canada is dependent on trade with the US. Economists say it risks a recession if Trump's tariffs are fully imposed. Several of Carney's new cabinet members served under Trudeau, and in particular he kept on those who have been working directly with the Trump administration in recent months. They including Mélanie Joly, who remains in foreign affairs; David McGuinty, who remains in public safety; Jonathan Wilkinson, staying on as energy minister; Dominic Leblanc, who has moved from finance to trade; and François-Philippe Champagne, moved from industry to finance. When the federal election comes, Carney's main rival will be Conservative leader Pierre Poilievre. Before the the threat of tariffs, Conservatives enjoyed a 20-point lead in some election polls. Now polls are indicating a much closer race. Speaking after Carney on Friday, Poilievre argued that Liberals do not deserve a fourth term in office, arguing adding they have already had nine years to improve affordability and other issues in the country. \"It will be the same Liberal results,\" he said. Poilievre added that if he were to be elected prime minister, he would \"face off against President Trump directly, respond with counter tariffs and take back control\". When Canadians next go to the polls, the Liberals will face not only the Conservatives - who are the official opposition with 120 seats in the House of Commons - but also the Bloc Quebecois, who have 33 seats, and the New Democrats (NDP), who have 24. Reacting to Carney's swearing in, the leader of the NDP argued that his cabinet appointments show that there is no room for progressive Liberals under his leadership. Jagmeet Singh said that he had failed to create separate cabinet portfolios for minister of women, youth, or people with disabilities, and described Carney as someone who has made billionaires \"very rich at the cost of workers\". The US Secretary of State called the ambassador a \"race-baiting politician who hates America\". The passage of the funding bill came hours before a shutdown, with Democrats under fierce pressure to oppose the measure. But Ukrainian President Volodymyr Zelensky accuses Russia of dragging out ceasefire talks so it can continue the war. Sharp divides over how to push back against Trump and Republicans have been laid bare in Congress, writes Anthony Zurcher. Marco Rubio and Mark Carney on Donald Trump's comments that Canada should be the 51st US state. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Search continues in Dominican Republic for missing student Sudiksha Konanki",
        "publisher": "BBC News",
        "published_date": "2025-03-15T01:31:23.502Z",
        "article_content": "Search efforts for a missing University of Pittsburgh student who disappeared on spring break while in the Dominican Republican have entered their second week. Sudiksha Konanki, 20, was last seen at a hotel around 04:00 local time on 6 March. Her disappearance is being investigated as a missing persons case as officials consider whether Ms Konanki may have drowned. The Dominican Republic attorney general indicated investigators are also not ruling out foul play. Ms Konanki is a 20-year-old college student attending the University of Pittsburgh, where she studies biology and chemistry. The college junior travelled with a group of five female friends to a resort in Punta Cana on a spring break trip, according to the Loudoun County Sheriff's Office. She is a citizen of India and a permanent resident of the United States. She lives with her family in Chantilly, Virginia, located in Loudoun County. Ms Konanki was last seen early in the morning of 6 March. Surveillance video shows her and a group of friends walking toward the beach. She was with five women and two American men in the video. Ms Konanki stayed on the beach with one of the men as the others returned to the hotel, Dominican police told the BBC's news partner CBS. Dominican President Luis Abinader said earlier this week during a news conference that the last person who had contact with Ms Konanki reported a wave hit them while they were on the beach. The parents of the man - Joshua Riibe - last seen with Ms Konanki released a statement to CBS News saying they hope Ms Konanki is \"found as soon as possible\". Riibe is a senior at St Cloud State University in Minnesota. \"We recognise that this is a complex and painful situation for all parties involved, and we trust that the investigation will be conducted with transparency and justice. Our only interest is that due process be respected and that actions be taken with the fairness that the situation requires,\" the statement reads. Officials said they've spent dozens of hours looking for Ms Konanki. Dominican police are dividing search areas and assigning drones to certain sectors. Pilots are monitoring footage that is being uploaded to a command centre where AI is looking to identify objects in the ocean. Search crews are looking in water and on land. Authorities say it's not clear whether foul play was involved in Ms Konanki's disappearance. There was no blood or signs of violence found at the beach. The University of Pittsburgh, where Ms Konanki is a student, said in a statement they are working with the Federal Bureau of Investigations, the Drug Enforcement Administration, Department of Homeland Security and local authorities in response to her disappearance. The International Criminal Police Organization, known as Interpol, issued a global alert after Ms Konanki went missing. The yellow notice is for missing persons such as victims of kidnappings or \"unexplained disappearances\". The US Secretary of State called the ambassador a \"race-baiting politician who hates America\". A Palestinian woman was arrested in New Jersey, while another activist from India chose to \"self-deport\", US officials say. The passage of the funding bill came hours before a shutdown, with Democrats under fierce pressure to oppose the measure. The new allegations include that the rapper forced an employee into sex acts - something his lawyers deny. The spacecraft will arrive at the International Space Station this weekend and is meant to return Butch Wilmore and Suni Williams home. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Mark Carney sworn in as first new Canadian prime minister in nine years",
        "publisher": "BBC News",
        "published_date": "2025-03-14T21:52:47.001Z",
        "article_content": "Mark Carney, an economist and political newcomer, has been sworn in as Canada's new prime minister, and delivered remarks vowing to \"never\" become a part of the United States. He took office on Friday just days after being elected leader of the governing Liberal Party and amid an ongoing trade war with US President Donald Trump. \"We know that by building together, we can give ourselves far more than anyone else can take away,\" he said after the ceremony. Carney replaces outgoing Prime Minister Justin Trudeau, who was in office for nine years, after a landslide victory in last week's Liberal leadership race. \"We will never, in any shape or form, be part of the US,\" Carney told reporters in Ottawa on Friday, referring to Trump's musings that Canada join the US as its \"51st state\". \"We are very fundamentally a different country,\" he said, later adding the notion is \"crazy\". He declined to answer questions about the timing of Canada's next federal election - currently scheduled for October - but hinted he would move quickly to seek \"as strong a mandate that is needed for the time\". In his first order as prime minister, Carney moved to end a policy that had been frequent attacked against by political opponents. He ended the consumer carbon pricing programme - a key environmental policy under Trudeau that had become deeply unpopular in recent years amid high inflation. Conservatives have criticised the tax, saying it raised the price of goods and energy for Canadian families. At an afternoon cabinet meeting, Carney said his government will still take steps to fight climate change. An industrial carbon tax on large emitters remains in place. Canadians receive a rebate to offset the cost of carbon pricing and will get their final cheque in April. Canadian politics in recent months have largely been overshadowed by the trade war Trump launched after taking office in January - and with a general election on the horizon, Carney is expected to pitch himself as the candidate best equipped to take on Trump. He previously held roles as governor of the Bank of Canada, the country's central bank, and of the Bank of England, and helped both countries weather major financial disruption. He intends to travel to the UK and France as his first foreign trip as PM next week. Carney said he also looks forward to speaking with Trump. \"We respect the United States. We respect President Trump,\" he said. \"President Trump is has put some very important issues at the top of his agenda.\" Carney has promised to uphold Canada's reciprocal tariffs on specific American goods for as long as Trump maintains 25% universal tariffs on Canadian goods not  covered by the Canada-United States-Mexico Agreement (CUSMA) trade deal. Canada is dependent on trade with the US. Economists say it risks a recession if Trump's tariffs are fully imposed. Several of Carney's new cabinet members served under Trudeau, and in particular he kept on those who have been working directly with the Trump administration in recent months. They including Mélanie Joly, who remains in foreign affairs; David McGuinty, who remains in public safety; Jonathan Wilkinson, staying on as energy minister; Dominic Leblanc, who has moved from finance to trade; and François-Philippe Champagne, moved from industry to finance. When the federal election comes, Carney's main rival will be Conservative leader Pierre Poilievre. Before the the threat of tariffs, Conservatives enjoyed a 20-point lead in some election polls. Now polls are indicating a much closer race. Speaking after Carney on Friday, Poilievre argued that Liberals do not deserve a fourth term in office, arguing adding they have already had nine years to improve affordability and other issues in the country. \"It will be the same Liberal results,\" he said. Poilievre added that if he were to be elected prime minister, he would \"face off against President Trump directly, respond with counter tariffs and take back control\". When Canadians next go to the polls, the Liberals will face not only the Conservatives - who are the official opposition with 120 seats in the House of Commons - but also the Bloc Quebecois, who have 33 seats, and the New Democrats (NDP), who have 24. Reacting to Carney's swearing in, the leader of the NDP argued that his cabinet appointments show that there is no room for progressive Liberals under his leadership. Jagmeet Singh said that he had failed to create separate cabinet portfolios for minister of women, youth, or people with disabilities, and described Carney as someone who has made billionaires \"very rich at the cost of workers\". The US Secretary of State called the ambassador a \"race-baiting politician who hates America\". The passage of the funding bill came hours before a shutdown, with Democrats under fierce pressure to oppose the measure. But Ukrainian President Volodymyr Zelensky accuses Russia of dragging out ceasefire talks so it can continue the war. Sharp divides over how to push back against Trump and Republicans have been laid bare in Congress, writes Anthony Zurcher. Marco Rubio and Mark Carney on Donald Trump's comments that Canada should be the 51st US state. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Sean 'Diddy' Combs pleads not guilty to updated indictment",
        "publisher": "BBC News",
        "published_date": "2025-03-15T00:11:59.542Z",
        "article_content": "Sean \"Diddy\" Combs has pleaded not guilty to an amended indictment that includes new allegations of forced labour. The superseding indictment alleges the rap mogul forced employees to work long hours under threat of physical and reputational harm and forced at least one worker to engage in sex acts with him. Mr Combs's lawyers have denied that the rap mogul has ever forced anyone into sex acts and that the case revolves around consensual relationships with his girlfriends, the New York Times reports. His lawyers have also \"vehemently\" denied all the accusations made against him in the federal case and dozens of civil lawsuits that have been filed against him in recent months. \"He looks forward to his day in court when it will become clear that he has never forced anyone to engage in sexual acts against their will,\" his lawyer Marc Agnifilo has said. Mr Combs, one of the most successful rappers in the US, is soon expected to stand trial in a federal sex trafficking and racketeering case. The new allegations detailed in the amended indictment come under the racketeering charge. Separately, Mr Combs faces dozens of lawsuits accusing him of rape and assault. His lawyers have dismissed the lawsuits as \"clear attempts to garner publicity.\" Mr Combs was led into a wood-panelled courtroom on Friday in New York's southern district federal court wearing a greenish-tan prison jumpsuit, with overgrown grey hair and a beard. He chose to stand as he entered his not guilty plea. Asked by a judge if he had seen and read the indictment, he responded, \"Yes, I have sir\". Behind him, in the public benches, his son Christian, his daughter Chance, his mother Janice Combs - wearing large sunglasses, and friend Marvet Britto (a publicist) came to support him, along with two other men who described themselves as part of the family's \"support system\". Mr Combs was smiling in court, waving and blowing kisses to his family and hugging his lawyers. As well as the new allegations, there was also much discussion in court between the prosecution and defence's lawyers over a video published by CNN last year appearing to show CCTV footage of Mr Combs kicking his former girlfriend, Cassandra Ventura, on a hotel hallway floor in 2016. Mr Combs's lawyers repeated their claims that the video was \"deceptive\" and that a visual expert had found that parts of the video were taken out of order, the actions sped up, and timestamps covered up. Prosecutors on the other hand described it as \"critical\" and \"direct evidence\" of their case that they will submit as an exhibit in the trial. The judge urged them to reach a compromise. CNN and a lawyer for Ms Ventura have denied what Mr Combs' lawyers said about the video. After the video was released in 2024, Mr Combs apologised for his behaviour, saying: \"I take full responsibility for my actions in that video. I was disgusted then when I did it. I'm disgusted now.\" On Friday, the judge said jury selection was expected to start on 5 May, and opening statements on 12 May. Levanna Mclean, who started the Bristol Northern Soul Club, says it is packed out every weekend. Grassroots Rising, which is set to go ahead next year, is the brainchild of Bristol rooted venue, Chai Wallahs. The US Secretary of State called the ambassador a \"race-baiting politician who hates America\". A Palestinian woman was arrested in New Jersey, while another activist from India chose to \"self-deport\", US officials say. The search for the missing University of Pittsburgh student, who was on spring break in Punta Cana, is entering its second week. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Florence and Pisa on alert as flooding hits Italy",
        "publisher": "BBC News",
        "published_date": "2025-03-14T15:23:32.507Z",
        "article_content": "There has been flooding and landslides in parts of northern Italy as red alerts cover cities including Florence and Pisa. Torrential rain prompted the alerts for parts of Tuscany and Emilia-Romagna, with heavy and persistent rainfall expected into the afternoon on Friday. Tuscany's president said local rescue and health services were on high alert and advised residents to exercise \"the utmost attention and caution\". Almost a month's worth of rain fell in Florence on Friday morning while landslides and mudslides were reported in Bologna, where some residents were evacuated on Thursday evening ahead of heavy rain overnight. No casualties have so far been reported, and the city said the worst of the flooding had passed by mid-morning on Friday. A family of four was rescued from a landslide in Badia Prataglia, Tuscany on Thursday evening, according to local media. The national fire brigade said it had received dozens of calls after the Rimaggio flooded and flowed through the Sesto Fiorentino area on Florence's northern outskirts. In Pisa, flood defences were being erected along the Arno river as local authorities warned it had surpassed the first flood-risk level. Roads were also affected by flooding and fallen trees, with residents in Florence advised against all travel after the A1 motorway was partially closed. Schools were shut in more than 60 municipalities in Tuscany, local media reported, as were several campuses of the University of Florence. Florence has seen more than double its average March rainfall of 61mm in the past three days. It saw more than 53mm of rain in just six hours on Friday morning, after a further 36mm had fallen overnight. The red weather alerts - indicating serious risk of extreme and widespread flooding - were set to continue throughout the day. Further heavy rain and thunderstorms are expected to move across the northern half of Italy into Saturday, before drier weather begins to move in. An area of high pressure in the north-east Atlantic has in recent days blocked the path of low pressure systems which normally pass to the north-west of the UK, sending them through the Mediterranean instead. Some rivers in Emilia-Romagna were already swollen after previous downpours. More than 1,000 people were evacuated from their homes in the north-eastern region in September 2024 after it was battered by Storm Boris. The previous year, 13 people died in the region after six months' worth of rainfall fell in a day and a half. Twenty rivers burst their banks and there were some 280 landslides. The devastating floods brought by Storm Boris were made worse by climate change, scientists at the World Weather Attribution group said. Europe is the fastest-warming continent - which not only brings much more frequent and intense heatwaves, but also more extreme rainfall. A hotter world means the atmosphere can hold more moisture, which can lead to heavier rainfall. Have you been affected by the floods in Italy? You can get in touch and send your photos here. An \"exciting milestone\" was reached in the construction with the arrival of a new working platform. Work relocating a pumping station, that was submerged by flood water, to higher ground is under way. The storm, which forecasters said could produce tornadoes, is expected to strengthen Friday and move towards the central US. The owners of Cogenhoe Mill say shutting the site is their \"only realistic option\". NOAA data helps many decide what to wear, where to meet friends and what to do during hurricane, tornado or blizzard emergencies. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Search continues in Dominican Republic for missing student Sudiksha Konanki",
        "publisher": "BBC News",
        "published_date": "2025-03-15T01:31:23.502Z",
        "article_content": "Search efforts for a missing University of Pittsburgh student who disappeared on spring break while in the Dominican Republican have entered their second week. Sudiksha Konanki, 20, was last seen at a hotel around 04:00 local time on 6 March. Her disappearance is being investigated as a missing persons case as officials consider whether Ms Konanki may have drowned. The Dominican Republic attorney general indicated investigators are also not ruling out foul play. Ms Konanki is a 20-year-old college student attending the University of Pittsburgh, where she studies biology and chemistry. The college junior travelled with a group of five female friends to a resort in Punta Cana on a spring break trip, according to the Loudoun County Sheriff's Office. She is a citizen of India and a permanent resident of the United States. She lives with her family in Chantilly, Virginia, located in Loudoun County. Ms Konanki was last seen early in the morning of 6 March. Surveillance video shows her and a group of friends walking toward the beach. She was with five women and two American men in the video. Ms Konanki stayed on the beach with one of the men as the others returned to the hotel, Dominican police told the BBC's news partner CBS. Dominican President Luis Abinader said earlier this week during a news conference that the last person who had contact with Ms Konanki reported a wave hit them while they were on the beach. The parents of the man - Joshua Riibe - last seen with Ms Konanki released a statement to CBS News saying they hope Ms Konanki is \"found as soon as possible\". Riibe is a senior at St Cloud State University in Minnesota. \"We recognise that this is a complex and painful situation for all parties involved, and we trust that the investigation will be conducted with transparency and justice. Our only interest is that due process be respected and that actions be taken with the fairness that the situation requires,\" the statement reads. Officials said they've spent dozens of hours looking for Ms Konanki. Dominican police are dividing search areas and assigning drones to certain sectors. Pilots are monitoring footage that is being uploaded to a command centre where AI is looking to identify objects in the ocean. Search crews are looking in water and on land. Authorities say it's not clear whether foul play was involved in Ms Konanki's disappearance. There was no blood or signs of violence found at the beach. The University of Pittsburgh, where Ms Konanki is a student, said in a statement they are working with the Federal Bureau of Investigations, the Drug Enforcement Administration, Department of Homeland Security and local authorities in response to her disappearance. The International Criminal Police Organization, known as Interpol, issued a global alert after Ms Konanki went missing. The yellow notice is for missing persons such as victims of kidnappings or \"unexplained disappearances\". The US Secretary of State called the ambassador a \"race-baiting politician who hates America\". A Palestinian woman was arrested in New Jersey, while another activist from India chose to \"self-deport\", US officials say. The passage of the funding bill came hours before a shutdown, with Democrats under fierce pressure to oppose the measure. The new allegations include that the rapper forced an employee into sex acts - something his lawyers deny. The spacecraft will arrive at the International Space Station this weekend and is meant to return Butch Wilmore and Suni Williams home. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
    },
    {
        "title": "Victory is everything, but not enough for England",
        "publisher": "BBC News",
        "published_date": "2025-03-14T14:59:29.388Z",
        "article_content": "Henry Pollock, 20, is set to make his Test debut away to Wales in a potential Six Nations title decider Guinness Men's Six Nations: Wales v England Venue: Principality Stadium, Cardiff Date: Saturday, 15 March Kick off: 16:45 GMT Coverage: Watch on BBC One, BBC Sport website and app, plus S4C via iPlayer. Text commentary and highlights on BBC Sport website and app. Listen live on BBC Radio Wales, BBC Radio Cymru and BBC Radio 5 Live England's teamsheets are usually best printed on grid paper. Head coach Steve Borthwick measures out the shape of his team, prioritising consistency and reliability with the care and consideration of a draughtsman. Loyalty is valued. Tweaks are minor. When Wednesday's teamsheet landed though, it was a departure. Names splattered in from leftfield, a free-form approach to positions, a delicious cheese-dream of a bench – a side picked like Jackson Pollock paints. Borthwick's selections over the campaign have been getting more adventurous, but this was a crank-up of the curveball. In total, there were seven positional or personnel changes to the starting XV for Saturday's trip to Wales. Tommy Freeman, only an occasional centre for his club, makes his first Test start in midfield. Wing Tom Roebuck makes his first Test start full-stop. Elliot Daly, the only back with north of 50 caps, pinballs back to the 11 shirt from full-back. Marcus Smith, who started the tournament at fly-half, is at 15. Across the matchday 23, there are three specialist fly-halves, four open-side flankers, one centre and one specialist second row. Back-row Ben Earl is primed to move into the backline. Twenty-year-old Henry Pollock is poised to make his debut. Ollie Sleightholme, who scored two tries in last weekend's win over Italy, and the 72-cap experience of Henry Slade are nowhere. This video can not be played 'Ugo said he'd shave his chest if England lose to Wales!' Six Nations title permutations - who needs what? Wales v England match preview, coverage & key stats Six Nations: We’re in Cardiff with Williams and Roebuck If it is uncharacteristic for this coach, it is not in keeping with the fixture either. The vision of 18-year-old Mathew Tait being slung under Gavin Henson's arm in 2005 lingers. The Principality has rarely been the place for England to experiment or christen new talent. But, while the usual city-centre storm will brew up for England's arrival, this trip to Cardiff is unique. Victory is everything, but also not quite enough. The Six Nations title permutations are complex. Given France's vast points difference advantage, England need France to fail to win against Scotland in Saturday's final game. If they do, an England victory of any kind over Wales would likely take them ahead of Fabien Galthie's men. A four-try bonus point is more likely to be needed however to stay ahead of Ireland, who lurk in third and play Italy earlier in the day. So, England, with a mobile back row of Earl and Tom and Ben Curry, feel the need for speed if they are to finish as Six Nations top guns. \"The thing you are seeing around the park is speed wins,\" said Earl in the week. \"We are talking a lot about moving the ball, being aggressive, outworking teams. Our players buy into that.\" With Pollock, Chandler Cunningham-South and Tom Willis on the bench, a complete recharge of the back row maybe possible to keep the needle high and the scoreboard ticking over in the second half. However, Wales will relish the chance to stick a spanner in the spokes and puncture such title pretensions. In Jac Morgan, they might have the player of the championship. As Wales have racked up the losses – 16 straight and counting – he has raged bright. He has made 73 tackles so far in the Championship – six more than any other player and only 12 short of Justin Tipuric's 2007 record for a Welshman in a Six Nations campaign. Morgan, right, has been proclaimed the best seven in Britain by his team-mate Dafydd Jenkins On the other side of the ball, he has made more metres through contact of any other player. Alongside Aaron Wainwright and the enduring class of Taulupe Faletau, he will be a formidable barricade to England's ambitions. After three home wins for England, Lions coach Andy Farrell will one of those interested to see how well the visitors cope when the hostilities ramp up and the noise builds. The final-round trip west has seen English touring hopes go south before. If the stars align and England do manage to track an unlikely route all the way to the trophy, it will have been a remarkable title win. Beaten by Ireland in the opening game, bettered in almost every facet by France in the second, a narrow conversion miss away from defeat by Scotland in the third, their campaign could have a very different complexion. Wales know how title bids can blossom from such unlikely ground though. In 2021, Wayne Pivac's side rode their luck and took their chances, benefiting from refereeing calls and opponents' indiscipline, to carry off the crown against the odds. Wales' title victory that year was also finally delivered via a Scotland upset in Paris. If, around 21:00 GMT on Saturday, it seems that the French are slipping up again and England have kept clear of Ireland in the standings, Steve Borthwick and his men will leave their team hotel and head into central Cardiff for a second time that day. Past the drinkers and Chip Alley eaters, they would wind their way up Westgate Street and back to the Principality Stadium. With their own final whistle having blown more than three hours earlier, the stands would be empty for a presentation featuring a replica trophy and a lack of local love. It would be a surreal, but very sweet final destination for a campaign that has teetered at times, but clung to a course. This video can not be played Who had a trial at Man City and who's scared of pigeons? Tuipulotu on famous family & why he picked England How much do you remember about Super Saturdays? Comments can not be loaded To load Comments you need to enable JavaScript in your browser Norris takes Melbourne pole with Hamilton eighth Victory is everything, but not enough for England I have to earn right to sing national anthem - Tuchel Why do humans dance? Preview an upcoming epic crime saga starring Sean Bean Uncovering the dark side of football hooliganism The 2002 heist that shook China’s airwaves Has Tuchel's first squad revealed England's short-term strategy? 'A ridiculously long wait - but trophy win would change everything' F1: Chequered Flag. AudioF1: Chequered Flag Sutton's predictions v Divorce singer Felix How do athletes manage sleep, and how can you improve yours? New teams, new rules, more money - Netball Super League's big relaunch Hampson on paralysing injury, helping others and England pride, 20 years on Gavin Henson: The kick that changed everything Will English teams win all three European competitions? The double-kick penalty that cost Atletico Madrid in shootout To Free Hit or not in gameweek 29? FPL tips & team of week Hamilton does not feel pressure to 'prove anything' How much do you remember about Super Saturdays? Will PSG tie provide Champions League redemption for Emery? 'I've still got big part to play' - historic night for Sterling Who plays who in Champions League quarter-finals? 'Ugo said he'd shave his chest if England lose to Wales!' Video'Ugo said he'd shave his chest if England lose to Wales!' Does Verstappen fear Russell but not Norris? F1 Q&A Man Utd's new stadium - 11 key questions From almost quitting football to Ballon d'Or hope - Raphinha's rebirth Copyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
    },
    {
        "title": "I have to earn right to sing national anthem - Tuchel",
        "publisher": "BBC News",
        "published_date": "2025-03-14T22:45:25.669Z",
        "article_content": "Thomas Tuchel has named his first squad since being appointed England manager England manager Thomas Tuchel says he has to \"earn the right\" to sing the national anthem. Tuchel, 51, named his 26-man squad for this month's World Cup qualifiers against Albania and Latvia on Friday and said he will not sing God Save the King before those matches. \"I feel that it is not just a given. You cannot just sing it. That's why I decided that I will not sing it in my first matches,\" the German said. After his appointment in October Tuchel said he had \"not decided\" whether or not to sing the anthem. The former Chelsea and Bayern Munich boss officially became England manager on 1 January but will make his debut in the Three Lions dugout against Albania on 21 March. \"I think, first of all, you have a very powerful, emotional and meaningful national anthem and I could not be more proud to be on the sidelines and be in charge of the English national team,\" Tuchel said. \"It means everything. It means a lot to me, I can assure you, but I can feel because it is that meaningful and it is that emotional and it is so powerful, the national anthem, that I have to earn my right to sing it.\" Lee Carsley was criticised during his interim spell in charge of England last year for not singing the anthem. Tuchel joked in his news conference following the squad announcement that he does know the words to the anthem, but plans to earn the right to sing it with \"results, building the group and doing my job properly\". \"Maybe I have to dive more into the culture and earn my right from you, from the players, from the supporters, so everyone feels like 'he should sing it now, he's one of our own, he's the English manager, he should sing it',\" he said. Has Tuchel's first squad revealed England's short-term strategy? Pick your England XI for World Cup qualifiers - and fans have their say Rashford returns as Tuchel names first England squad Norris takes Melbourne pole with Hamilton eighth Victory is everything, but not enough for England I have to earn right to sing national anthem - Tuchel Why do humans dance? Preview an upcoming epic crime saga starring Sean Bean Uncovering the dark side of football hooliganism The 2002 heist that shook China’s airwaves Has Tuchel's first squad revealed England's short-term strategy? 'A ridiculously long wait - but trophy win would change everything' F1: Chequered Flag. AudioF1: Chequered Flag Sutton's predictions v Divorce singer Felix How do athletes manage sleep, and how can you improve yours? New teams, new rules, more money - Netball Super League's big relaunch Hampson on paralysing injury, helping others and England pride, 20 years on Gavin Henson: The kick that changed everything Will English teams win all three European competitions? The double-kick penalty that cost Atletico Madrid in shootout To Free Hit or not in gameweek 29? FPL tips & team of week Hamilton does not feel pressure to 'prove anything' How much do you remember about Super Saturdays? Will PSG tie provide Champions League redemption for Emery? 'I've still got big part to play' - historic night for Sterling Who plays who in Champions League quarter-finals? 'Ugo said he'd shave his chest if England lose to Wales!' Video'Ugo said he'd shave his chest if England lose to Wales!' Does Verstappen fear Russell but not Norris? F1 Q&A Man Utd's new stadium - 11 key questions From almost quitting football to Ballon d'Or hope - Raphinha's rebirth Copyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
    },
    {
        "title": "Andreeva to face Sabalenka in Indian Wells final",
        "publisher": "BBC News",
        "published_date": "2025-03-15T07:16:42.439Z",
        "article_content": "Mirra Andreeva will meet top seed Aryna Sabalenka in the women's final at Indian Wells on Sunday Rising Russian star Mirra Andreeva became the first 17-year-old player to reach the women's final at Indian Wells since 2001 after overcoming defending champion Iga Swiatek in the last four. She beat the world number two for the second time in as many tournaments, after knocking her out at the quarter-final stage in Dubai in February on her way to becoming the youngest winner of a WTA 1000 tournament. Andreeva extended her winning streak to 11 matches as she bounced back from losing a one-sided second set to beat the experienced Pole 7-6 (7-1) 1-6 6-3. She will face top seed Aryna Sabalenka in the final after the Belarusian avenged her defeat by American Madison Keys at the Australian Open in brutal fashion to win 6-0 6-1. \"I feel that I was dealing with the nerves and the pressure pretty good, so I just feel proud of myself,\" said ninth seed Andreeva on her recovery in the final set. \"After she literally killed me in the second set, I was just 'well, OK, might just try to fight'. There is not much I could do about it. She was playing amazing. \"And I just kind of decided to grind and fight for every point. It doesn't matter how I put the ball in. But I have to put it in. So I just try to do everything and in the end, it was not too bad.\" Andreeva is the youngest woman to reach the Indian Wells final since Kim Clijsters, who lost to Serena Williams in 2001. She will face another big test in world number one Sabalenka, who took just 51 minutes to dismiss fifth seed Keys. It was a repeat of their Australian Open final, which Keys won 6-3 2-6 7-5 to end Sabalenka's hopes of a third consecutive title in Melbourne. \"That Australian Open match was really heartbreaking for me, and I really needed some time to recover after that,\" said Sabalenka. \"And if I would lose today again, it would get in my head and I didn't want that to happen. I was really focused, so I was just really hungry to get this win against Madison.\" Live scores, results and order of play Get tennis news sent straight to your phone Norris takes Melbourne pole with Hamilton eighth Victory is everything, but not enough for England I have to earn right to sing national anthem - Tuchel Why do humans dance? Preview an upcoming epic crime saga starring Sean Bean Uncovering the dark side of football hooliganism The 2002 heist that shook China’s airwaves Has Tuchel's first squad revealed England's short-term strategy? 'A ridiculously long wait - but trophy win would change everything' F1: Chequered Flag. AudioF1: Chequered Flag Sutton's predictions v Divorce singer Felix How do athletes manage sleep, and how can you improve yours? New teams, new rules, more money - Netball Super League's big relaunch Hampson on paralysing injury, helping others and England pride, 20 years on Gavin Henson: The kick that changed everything Will English teams win all three European competitions? The double-kick penalty that cost Atletico Madrid in shootout To Free Hit or not in gameweek 29? FPL tips & team of week Hamilton does not feel pressure to 'prove anything' How much do you remember about Super Saturdays? Will PSG tie provide Champions League redemption for Emery? 'I've still got big part to play' - historic night for Sterling Who plays who in Champions League quarter-finals? 'Ugo said he'd shave his chest if England lose to Wales!' Video'Ugo said he'd shave his chest if England lose to Wales!' Does Verstappen fear Russell but not Norris? F1 Q&A Man Utd's new stadium - 11 key questions From almost quitting football to Ballon d'Or hope - Raphinha's rebirth Copyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
    },
    {
        "title": "Guardiola hits back at Capello's 'arrogant' jibe",
        "publisher": "BBC News",
        "published_date": "2025-03-14T22:30:24.989Z",
        "article_content": "Between them, Fabio Capello (seven) and Pep Guardiola (12) have won 19 league titles with six different clubs Pep Guardiola has hit back at Fabio Capello's latest criticism of his management style - and the Manchester City boss insists he has \"raised the bar\" in the Premier League. The pair have had a frosty relationship since the Italian managed Guardiola for a short time at Roma in 2002, and the 78-year-old felt the Spaniard spoke out of turn. Capello reignited their feud in the middle of City's woeful run of one win in 13 games earlier this season. Speaking on Sky Italia, the former Juventus, AC Milan and England coach said Guardiola was \"way too arrogant and presumptuous\" because he wanted to prove City were winning matches through his tactics. While they have stabilised their campaign, City are still struggling for consistency and are fifth in the Premier League and face an FA Cup quarter-final at Bournemouth on 30 March for their only chance of a major trophy this season, having won the Community Shield in August. After their 1-0 defeat at third-placed Nottingham Forest last weekend, Capello gave an interview to Spanish newspaper El Mundo in which, while praising Guardiola's tactics, he said the City manager was \"arrogant\" and had \"caused enormous damage\" to Italian football because coaches tried to imitate his tactics. Guardiola was clearly aware of the comments, given the manner in which he acknowledged them when a question was asked before Saturday's league game against Brighton. \"I listen to everything that people say about me, so be careful,\" he said. \"It's not the first time Mr Fabio Capello has said that. I'm not good enough to ruin Italian football. A big hug to Fabio. A big hug.\" The response continued a long-established policy of Guardiola referring to individuals he has a problem with as \"Mr\", which includes former player Joao Cancelo, ex-midfielder Yaya Toure's agent Dimitri Seluk and Kevin Parker, general secretary of the Manchester City supporters' club, who got embroiled in a spat over attendances. The sarcasm extended to a second answer as he assessed the ability of middle-ranking Premier League teams to win the title in the future. \"I don't want to pretend to be, and naming again one of the big managers, one of the exceptional managers in Fabio Capello, and look arrogant, but we helped raise the bar in the Premier League,\" added Guardiola, who made five appearances in his one-year playing spell at Roma. \"Teams had to go to the markets and that helps people. People want to do good, people are well organised, have good structures, good decisions, good players everywhere. \"I've been here when I went to Bournemouth in the beginning, and now it's different. And when I went in the beginning in Brighton, and now it's different. And when I went in Fulham in the beginning, and now it's different.\" Bournemouth, Brighton and Fulham have played in the Championship during Guardiola's nine-year City tenure and are now challenging for Champions League qualification places this season. \"I'm an old guy, I'm the oldest manager here, nine years. So I know the evolution of the Premier League has been massive,\" he added. Latest Manchester City news, analysis and fan views Get Manchester City news sent straight to your phone Comments can not be loaded To load Comments you need to enable JavaScript in your browser Norris takes Melbourne pole with Hamilton eighth Victory is everything, but not enough for England I have to earn right to sing national anthem - Tuchel Why do humans dance? Preview an upcoming epic crime saga starring Sean Bean Uncovering the dark side of football hooliganism The 2002 heist that shook China’s airwaves Has Tuchel's first squad revealed England's short-term strategy? 'A ridiculously long wait - but trophy win would change everything' F1: Chequered Flag. AudioF1: Chequered Flag Sutton's predictions v Divorce singer Felix How do athletes manage sleep, and how can you improve yours? New teams, new rules, more money - Netball Super League's big relaunch Hampson on paralysing injury, helping others and England pride, 20 years on Gavin Henson: The kick that changed everything Will English teams win all three European competitions? The double-kick penalty that cost Atletico Madrid in shootout To Free Hit or not in gameweek 29? FPL tips & team of week Hamilton does not feel pressure to 'prove anything' How much do you remember about Super Saturdays? Will PSG tie provide Champions League redemption for Emery? 'I've still got big part to play' - historic night for Sterling Who plays who in Champions League quarter-finals? 'Ugo said he'd shave his chest if England lose to Wales!' Video'Ugo said he'd shave his chest if England lose to Wales!' Does Verstappen fear Russell but not Norris? F1 Q&A Man Utd's new stadium - 11 key questions From almost quitting football to Ballon d'Or hope - Raphinha's rebirth Copyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
    },
    {
        "title": "Victory is everything, but not enough for England",
        "publisher": "BBC News",
        "published_date": "2025-03-14T14:59:29.388Z",
        "article_content": "Henry Pollock, 20, is set to make his Test debut away to Wales in a potential Six Nations title decider Guinness Men's Six Nations: Wales v England Venue: Principality Stadium, Cardiff Date: Saturday, 15 March Kick off: 16:45 GMT Coverage: Watch on BBC One, BBC Sport website and app, plus S4C via iPlayer. Text commentary and highlights on BBC Sport website and app. Listen live on BBC Radio Wales, BBC Radio Cymru and BBC Radio 5 Live England's teamsheets are usually best printed on grid paper. Head coach Steve Borthwick measures out the shape of his team, prioritising consistency and reliability with the care and consideration of a draughtsman. Loyalty is valued. Tweaks are minor. When Wednesday's teamsheet landed though, it was a departure. Names splattered in from leftfield, a free-form approach to positions, a delicious cheese-dream of a bench – a side picked like Jackson Pollock paints. Borthwick's selections over the campaign have been getting more adventurous, but this was a crank-up of the curveball. In total, there were seven positional or personnel changes to the starting XV for Saturday's trip to Wales. Tommy Freeman, only an occasional centre for his club, makes his first Test start in midfield. Wing Tom Roebuck makes his first Test start full-stop. Elliot Daly, the only back with north of 50 caps, pinballs back to the 11 shirt from full-back. Marcus Smith, who started the tournament at fly-half, is at 15. Across the matchday 23, there are three specialist fly-halves, four open-side flankers, one centre and one specialist second row. Back-row Ben Earl is primed to move into the backline. Twenty-year-old Henry Pollock is poised to make his debut. Ollie Sleightholme, who scored two tries in last weekend's win over Italy, and the 72-cap experience of Henry Slade are nowhere. This video can not be played 'Ugo said he'd shave his chest if England lose to Wales!' Six Nations title permutations - who needs what? Wales v England match preview, coverage & key stats Six Nations: We’re in Cardiff with Williams and Roebuck If it is uncharacteristic for this coach, it is not in keeping with the fixture either. The vision of 18-year-old Mathew Tait being slung under Gavin Henson's arm in 2005 lingers. The Principality has rarely been the place for England to experiment or christen new talent. But, while the usual city-centre storm will brew up for England's arrival, this trip to Cardiff is unique. Victory is everything, but also not quite enough. The Six Nations title permutations are complex. Given France's vast points difference advantage, England need France to fail to win against Scotland in Saturday's final game. If they do, an England victory of any kind over Wales would likely take them ahead of Fabien Galthie's men. A four-try bonus point is more likely to be needed however to stay ahead of Ireland, who lurk in third and play Italy earlier in the day. So, England, with a mobile back row of Earl and Tom and Ben Curry, feel the need for speed if they are to finish as Six Nations top guns. \"The thing you are seeing around the park is speed wins,\" said Earl in the week. \"We are talking a lot about moving the ball, being aggressive, outworking teams. Our players buy into that.\" With Pollock, Chandler Cunningham-South and Tom Willis on the bench, a complete recharge of the back row maybe possible to keep the needle high and the scoreboard ticking over in the second half. However, Wales will relish the chance to stick a spanner in the spokes and puncture such title pretensions. In Jac Morgan, they might have the player of the championship. As Wales have racked up the losses – 16 straight and counting – he has raged bright. He has made 73 tackles so far in the Championship – six more than any other player and only 12 short of Justin Tipuric's 2007 record for a Welshman in a Six Nations campaign. Morgan, right, has been proclaimed the best seven in Britain by his team-mate Dafydd Jenkins On the other side of the ball, he has made more metres through contact of any other player. Alongside Aaron Wainwright and the enduring class of Taulupe Faletau, he will be a formidable barricade to England's ambitions. After three home wins for England, Lions coach Andy Farrell will one of those interested to see how well the visitors cope when the hostilities ramp up and the noise builds. The final-round trip west has seen English touring hopes go south before. If the stars align and England do manage to track an unlikely route all the way to the trophy, it will have been a remarkable title win. Beaten by Ireland in the opening game, bettered in almost every facet by France in the second, a narrow conversion miss away from defeat by Scotland in the third, their campaign could have a very different complexion. Wales know how title bids can blossom from such unlikely ground though. In 2021, Wayne Pivac's side rode their luck and took their chances, benefiting from refereeing calls and opponents' indiscipline, to carry off the crown against the odds. Wales' title victory that year was also finally delivered via a Scotland upset in Paris. If, around 21:00 GMT on Saturday, it seems that the French are slipping up again and England have kept clear of Ireland in the standings, Steve Borthwick and his men will leave their team hotel and head into central Cardiff for a second time that day. Past the drinkers and Chip Alley eaters, they would wind their way up Westgate Street and back to the Principality Stadium. With their own final whistle having blown more than three hours earlier, the stands would be empty for a presentation featuring a replica trophy and a lack of local love. It would be a surreal, but very sweet final destination for a campaign that has teetered at times, but clung to a course. This video can not be played Who had a trial at Man City and who's scared of pigeons? Tuipulotu on famous family & why he picked England How much do you remember about Super Saturdays? Comments can not be loaded To load Comments you need to enable JavaScript in your browser Norris takes Melbourne pole with Hamilton eighth Victory is everything, but not enough for England I have to earn right to sing national anthem - Tuchel Why do humans dance? Preview an upcoming epic crime saga starring Sean Bean Uncovering the dark side of football hooliganism The 2002 heist that shook China’s airwaves Has Tuchel's first squad revealed England's short-term strategy? 'A ridiculously long wait - but trophy win would change everything' F1: Chequered Flag. AudioF1: Chequered Flag Sutton's predictions v Divorce singer Felix How do athletes manage sleep, and how can you improve yours? New teams, new rules, more money - Netball Super League's big relaunch Hampson on paralysing injury, helping others and England pride, 20 years on Gavin Henson: The kick that changed everything Will English teams win all three European competitions? The double-kick penalty that cost Atletico Madrid in shootout To Free Hit or not in gameweek 29? FPL tips & team of week Hamilton does not feel pressure to 'prove anything' How much do you remember about Super Saturdays? Will PSG tie provide Champions League redemption for Emery? 'I've still got big part to play' - historic night for Sterling Who plays who in Champions League quarter-finals? 'Ugo said he'd shave his chest if England lose to Wales!' Video'Ugo said he'd shave his chest if England lose to Wales!' Does Verstappen fear Russell but not Norris? F1 Q&A Man Utd's new stadium - 11 key questions From almost quitting football to Ballon d'Or hope - Raphinha's rebirth Copyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
    },
    {
        "title": "Guardiola hits back at Capello's 'arrogant' jibe",
        "publisher": "BBC News",
        "published_date": "2025-03-14T22:30:24.989Z",
        "article_content": "Between them, Fabio Capello (seven) and Pep Guardiola (12) have won 19 league titles with six different clubs Pep Guardiola has hit back at Fabio Capello's latest criticism of his management style - and the Manchester City boss insists he has \"raised the bar\" in the Premier League. The pair have had a frosty relationship since the Italian managed Guardiola for a short time at Roma in 2002, and the 78-year-old felt the Spaniard spoke out of turn. Capello reignited their feud in the middle of City's woeful run of one win in 13 games earlier this season. Speaking on Sky Italia, the former Juventus, AC Milan and England coach said Guardiola was \"way too arrogant and presumptuous\" because he wanted to prove City were winning matches through his tactics. While they have stabilised their campaign, City are still struggling for consistency and are fifth in the Premier League and face an FA Cup quarter-final at Bournemouth on 30 March for their only chance of a major trophy this season, having won the Community Shield in August. After their 1-0 defeat at third-placed Nottingham Forest last weekend, Capello gave an interview to Spanish newspaper El Mundo in which, while praising Guardiola's tactics, he said the City manager was \"arrogant\" and had \"caused enormous damage\" to Italian football because coaches tried to imitate his tactics. Guardiola was clearly aware of the comments, given the manner in which he acknowledged them when a question was asked before Saturday's league game against Brighton. \"I listen to everything that people say about me, so be careful,\" he said. \"It's not the first time Mr Fabio Capello has said that. I'm not good enough to ruin Italian football. A big hug to Fabio. A big hug.\" The response continued a long-established policy of Guardiola referring to individuals he has a problem with as \"Mr\", which includes former player Joao Cancelo, ex-midfielder Yaya Toure's agent Dimitri Seluk and Kevin Parker, general secretary of the Manchester City supporters' club, who got embroiled in a spat over attendances. The sarcasm extended to a second answer as he assessed the ability of middle-ranking Premier League teams to win the title in the future. \"I don't want to pretend to be, and naming again one of the big managers, one of the exceptional managers in Fabio Capello, and look arrogant, but we helped raise the bar in the Premier League,\" added Guardiola, who made five appearances in his one-year playing spell at Roma. \"Teams had to go to the markets and that helps people. People want to do good, people are well organised, have good structures, good decisions, good players everywhere. \"I've been here when I went to Bournemouth in the beginning, and now it's different. And when I went in the beginning in Brighton, and now it's different. And when I went in Fulham in the beginning, and now it's different.\" Bournemouth, Brighton and Fulham have played in the Championship during Guardiola's nine-year City tenure and are now challenging for Champions League qualification places this season. \"I'm an old guy, I'm the oldest manager here, nine years. So I know the evolution of the Premier League has been massive,\" he added. Latest Manchester City news, analysis and fan views Get Manchester City news sent straight to your phone Comments can not be loaded To load Comments you need to enable JavaScript in your browser Norris takes Melbourne pole with Hamilton eighth Victory is everything, but not enough for England I have to earn right to sing national anthem - Tuchel Why do humans dance? Preview an upcoming epic crime saga starring Sean Bean Uncovering the dark side of football hooliganism The 2002 heist that shook China’s airwaves Has Tuchel's first squad revealed England's short-term strategy? 'A ridiculously long wait - but trophy win would change everything' F1: Chequered Flag. AudioF1: Chequered Flag Sutton's predictions v Divorce singer Felix How do athletes manage sleep, and how can you improve yours? New teams, new rules, more money - Netball Super League's big relaunch Hampson on paralysing injury, helping others and England pride, 20 years on Gavin Henson: The kick that changed everything Will English teams win all three European competitions? The double-kick penalty that cost Atletico Madrid in shootout To Free Hit or not in gameweek 29? FPL tips & team of week Hamilton does not feel pressure to 'prove anything' How much do you remember about Super Saturdays? Will PSG tie provide Champions League redemption for Emery? 'I've still got big part to play' - historic night for Sterling Who plays who in Champions League quarter-finals? 'Ugo said he'd shave his chest if England lose to Wales!' Video'Ugo said he'd shave his chest if England lose to Wales!' Does Verstappen fear Russell but not Norris? F1 Q&A Man Utd's new stadium - 11 key questions From almost quitting football to Ballon d'Or hope - Raphinha's rebirth Copyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
    }
]